package com.sbank.admin.common.resolver;

import java.util.Map;
import java.util.Map.Entry;
import java.util.Set;

/**--------------------------------------------------------------------
 * ■Request 파라미터(JSON Style)를 변환하여 전달할 Value Object ■payletter ■2018-09-28
 --------------------------------------------------------------------**/
public class RequestParameterMap<K, V> {
	private Map<K, V> map;

    /**--------------------------------------------------------------------
     * ■해당 Key의 Value가 존재하는지 리턴 ■payletter ■2018-09-28
     --------------------------------------------------------------------**/
	public boolean containsKey(K objKey) {
		return map.containsKey(objKey);
	}

    /**--------------------------------------------------------------------
     * ■해당 Object가 존재하는지 리턴 ■payletter ■2018-09-28
     --------------------------------------------------------------------**/
	public boolean containsValue(V objValue) {
		return map.containsValue(objValue);
	}

    /**--------------------------------------------------------------------
     * ■해당 Key의 Value를 리턴 ■payletter ■2018-09-28
     --------------------------------------------------------------------**/
	public V get(K objKey) {
		return map.get(objKey);
	}

    /**--------------------------------------------------------------------
     * ■Key와 Value로 Map에 저장 ■payletter ■2018-09-28
     --------------------------------------------------------------------**/
	public V put(K objKey, V objValue) {
		return map.put(objKey, objValue);
	}

    /**--------------------------------------------------------------------
     * ■Map이 비었는지 리턴 ■payletter ■2018-09-28
     --------------------------------------------------------------------**/
	public boolean isEmpty() {
		return map.isEmpty();
	}

    /**--------------------------------------------------------------------
     * ■Map의 key Set을 리턴함 ■payletter ■2018-09-28
     --------------------------------------------------------------------**/
	public Set<K> keySet() {
		return map.keySet();
	}

    /**--------------------------------------------------------------------
     * ■해당 Map의 mapping들을 Map에 복사함 ■payletter ■2018-09-28
     --------------------------------------------------------------------**/
	public void putAll(Map<? extends K, ? extends V> m) {
		map.putAll(m);
	}

    /**--------------------------------------------------------------------
     * ■Map에서 Key로서 대상 제거 ■payletter ■2018-09-28
     --------------------------------------------------------------------**/
	public V remove(K objKey) {
		return map.remove(objKey);
	}

    /**--------------------------------------------------------------------
     * ■MMap의 사이즈 리턴 ■payletter ■2018-09-28
     --------------------------------------------------------------------**/
	public int size() {
		return map.size();
	}

    /**--------------------------------------------------------------------
     * ■Map을 Set으로 리턴함 ■payletter ■2018-09-28
     --------------------------------------------------------------------**/
	public Set<Entry<K, V>> entrySet() {
		return map.entrySet();
	}

    /**--------------------------------------------------------------------
     * ■멤버 변수 map의 Setter ■payletter ■2018-09-28
     --------------------------------------------------------------------**/
	public void setMap(Map<K, V> map) {
		this.map = map;
	}

	@Override
	public String toString(){
		return map.toString();
	}
}
